recipes/creamy-potato-and-leek-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creamy Potato and Leek Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Creamy Potato and Leek Soup</h1>
<p>
<a href="https://lovingitvegan.com/vegan-potato-leek-soup/">Original link</a>
</p>

<div id="outline-container-orga43da51" class="outline-2">
<h2 id="orga43da51">Ingredients</h2>
<div class="outline-text-2" id="text-orga43da51">
<ul class="org-ul">
<li>1 Onion (Chopped)</li>
<li>1 tsp Crushed Garlic</li>
<li>1 Tbsp Olive Oil</li>
<li>4 Large Leeks (white and light green parts only, chopped)</li>
<li>1 tsp Dried Thyme</li>
<li>1 tsp Dried Rosemary</li>
<li>1/2 tsp Coriander Powder</li>
<li>6 Medium Potatoes (~1kg) – peeled and chopped</li>
<li>2 Bay Leaves</li>
<li>4 Cups Vegetable Stock/Broth</li>
<li>400ml Can Coconut Cream</li>
<li>Sea Salt and Black Pepper (to taste)</li>
<li>Fresh Chives (Chopped)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd389759" class="outline-2">
<h2 id="orgd389759">Method</h2>
<div class="outline-text-2" id="text-orgd389759">
<ol class="org-ol">
<li>Add the chopped onion and leeks to a pot with the crushed garlic and olive oil and sauté until softened. Add in the thyme, rosemary and coriander powder and sauté.</li>
<li>Add the chopped potatoes, bay leaves and vegetable stock and bring to a boil. Reduce the heat, cover the pot and simmer until the potatoes are soft and cooked.</li>
<li>Remove from the heat and remove the bay leaves.</li>
<li>Then add in the coconut cream.</li>
<li>Blend the soup using an immersion blender for the easiest blending or, if you don’t have an immersion blender, transfer in stages to a blender jug and blend until smooth.</li>
<li>Add sea salt and black pepper to taste.
Serve with fresh chopped chives.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
